DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыКПоступлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКПоступлению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОформлениюНакладныхПоРаспоряжению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоРаспоряжению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоНакладным</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюПоступленийПоОрдерам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюОрдеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принимается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/МобильноеРабочееМестоКладовщика/Forms/Отбор/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Литерал = "Ссылка";
	Ссылка = Параметры[Литерал];
	ПоказыватьФотоТоваров = Параметры.ПоказыватьФотоТоваров; 
	Бесшовный = Параметры.Бесшовный;
	Штрихкод = Параметры.Штрихкод;
	ПорядокСканирования = Параметры.ПорядокСканирования;
	
	ЗаблокироватьДанныеДляРедактирования(Ссылка,,УникальныйИдентификатор);
	
	ЗаполнитьФорму();
		
	//++ Локализация
		
	ИспользоватьУчетМаркируемойПродукции = Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить();
#Если Не МобильныйАвтономныйСервер Тогда
	ПроверкаИПодборПродукцииИСПереопределяемый.ПриОпределенииОрганизации(Ссылка, Организация);

	ЕстьМаркируемаяПродукция = Ложь;
	ВидыПродукцииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	ПроверкаИПодборПродукцииИСМПУТ.ЕстьМаркируемаяПродукцияВКоллекции(ТоварыОтобрать, ВидыПродукцииИСМП, ЕстьМаркируемаяПродукция);
	Если НЕ ЕстьМаркируемаяПродукция Тогда
		ПроверкаИПодборПродукцииИСМПУТ.ЕстьМаркируемаяПродукцияВКоллекции(ТоварыОтобрано, ВидыПродукцииИСМП, ЕстьМаркируемаяПродукция);
	КонецЕсли;
#Иначе
	ЕстьМаркируемаяПродукция = Ложь;
#КонецЕсли

	//-- Локализация
	
	ЕстьПравоНаПроверкуОрдера = Обработки.МобильноеРабочееМестоКладовщика.ЕстьПравоНаПроверкуСвоихОрдеров();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОформитьМеню("Отобрать");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"] Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ОформитьМеню("Отобрать");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		// ПодключаемоеОборудование
		Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
			
			ЕстьНеобработанноеСобытие = МобильноеРабочееМестоКладовщикаКлиент.ЕстьНеобработанноеСобытие();
			
			Если ИмяСобытия = "ScanData" И ЕстьНеобработанноеСобытие Тогда
				
				Данные = МобильноеРабочееМестоКладовщикаКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
				
				ОбработатьШтрихкод(Данные);

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	
	ЗаполнитьЗонуПриемки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыОтобрать

&НаКлиенте
Процедура ТоварыОтобратьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("Режим", "ОтборИзЯчейкиОтгрузка");
	ПараметрыФормы.Вставить("НомерСтроки", ТоварыОтобрать.Индекс(Элементы.ТоварыОтобрать.ТекущиеДанные));
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("Ячейка", Элемент.ТекущиеДанные.Ячейка);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ДокументИсточник", Ссылка);
	ПараметрыФормы.Вставить("РаспоряжениеНаОтбор", Распоряжение);
	ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыОтобрано

&НаКлиенте
Процедура ТоварыОтобраноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОбновитьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("Режим", "РедактированиеОтборИзЯчейкиОтгрузка");
	ПараметрыФормы.Вставить("НомерСтроки", ТоварыОтобрано.Индекс(Элементы.ТоварыОтобрано.ТекущиеДанные));
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("Ячейка", Элемент.ТекущиеДанные.Ячейка);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ДокументИсточник", Ссылка);
	ПараметрыФормы.Вставить("РаспоряжениеНаОтбор", Распоряжение);
	ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Информация(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
	СкрытьМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРазделОтобрать(Команда)
	
	ОформитьМеню("Отобрать");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРазделОтобрано(Команда)
	
	ОформитьМеню("Отобрано");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьОтбор(Команда)
	
	Если ТоварыОтобрано.Количество() = 0 Тогда
		Состояние(НСтр("ru = 'Не возможно закончить отбор, пока не отобрано ни одного товара.'"));
		Возврат;
	КонецЕсли; 
		
	СписокЗначений = Новый СписокЗначений;	

	Если ТоварыОтобрать.Количество() И Бесшовный Тогда
		СписокЗначений.Добавить("НеОтгружать", НСтр("ru = 'Отменить отгрузку товаров'"));
		СписокЗначений.Добавить("КОтбору", НСтр("ru = 'Оставить ордер к отбору'"));
		СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить отбор'"));
		ТекстСообщения = НСтр("ru = 'Отобраны не все товары, отгружаемые ордером. Отменить отгрузку не отобранных товаров в ордере и перевести ордер к проверке или оставить ордер к отбору?'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПродолжение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстСообщения, СписокЗначений, 0);
	Иначе
		ПослеЗакрытияВопросаПродолжение("Завершить");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьВсе(Команда)
	
	СобратьВсеНаСервере();
	ОформитьМеню("Принято");
	
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("ДокументСсылка", Ссылка);
	ПараметрыФормы.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
		
	Если ПорядокСканирования = "СначалаСканированиеЯчейки" Тогда
		
		Описание = Новый ОписаниеОповещения("РезультатСканированияЯчейки", ЭтотОбъект);
		ПараметрыФормы.Вставить("ТипПоиска", "ПоискЯчейки");
		
	Иначе
		
		Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);
		ПараметрыФормы.Вставить("ТипПоиска", "ПоискНоменклатуры");
		ПараметрыФормы.Вставить("Организация", Организация);
		
	КонецЕсли;
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкода", ПараметрыФормы,
			ЭтотОбъект,,,, Описание,
			РежимОткрытияОкнаФормы.Независимый);
	Иначе
		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.СканированиеШтрихкодаАвтономныйРежим", ПараметрыФормы,
			ЭтотОбъект,,,, Описание,
			РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки(Команда)
	Описание = Новый ОписаниеОповещения("ИзменитьШтрихкодыУпаковок", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.СписокКодовМаркировки",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтбор(Команда)
	
	ИндексСтроки = ТоварыОтобрано.Индекс(Элементы.ТоварыОтобрано.ТекущиеДанные);
	ОтменитьОтборСервер(ИндексСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаданиеНаОтбор(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Завершить", НСтр("ru = 'Пометить документ на удаление'"));
	СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить отбор'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОтменитьЗаданиеНаОтбор", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Для отмены отбора необходимо пометить на удаление документ отбора. Вернуться к редактированию будет невозможно. Пометить на удаление?'"), СписокЗначений, 0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элементы.КодыМаркировки.Видимость = ИспользоватьУчетМаркируемойПродукции И ЕстьМаркируемаяПродукция;
	
#Если МобильныйАвтономныйСервер Тогда
	Элементы.ФормаОтменитьЗаданиеНаОтбор.Видимость = Ложь;
#Иначе
	Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
	Если Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено
		И ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ОтборРазмещениеТоваров) Тогда
		Элементы.ФормаОтменитьЗаданиеНаОтбор.Видимость = Истина;
	Иначе
		Элементы.ФормаОтменитьЗаданиеНаОтбор.Видимость = Ложь;
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ДанныеШтрихкода)
		
	ШтрихкодыВалидны = МобильноеРабочееМестоКладовщикаКлиент.ШтрихкодыВалидны(ДанныеШтрихкода);
	
	Если Не ШтрихкодыВалидны Тогда
		Возврат;
	КонецЕсли;
		
	Если Штрихкод = ДанныеШтрихкода.Штрихкод Тогда  
		
		Если ТоварыОтобрано.Количество() = 0 Тогда
			ТекстОшибки = НСтр("ru = 'Не возможно закончить отбор, пока не отобрано ни одного товара.'");
			Состояние(ТекстОшибки);
			Возврат;
		КонецЕсли;
				
		Если ТоварыОтобрать.Количество() И Бесшовный Тогда
			
			Описание = Новый ОписаниеОповещения("ПослеЗакрытияФормыВопроса", ЭтотОбъект);
			ПараметрыФормы = Новый Структура("Режим", "Отбор");
			
			ОткрытьФорму(
				"Обработка.МобильноеРабочееМестоКладовщика.Форма.ФормаВопросаСканирование", ПараметрыФормы,
				ЭтотОбъект,,,, Описание, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
				
		Иначе
			ОтборЗавершен = ЗакончитьОтборНаСервере("Завершить", "Завершить");
		
			Если ОтборЗавершен Тогда
				ОткрытьФормуРасходногоОрдера();
			Иначе
				Состояние(ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СначалаПоискЯчейки = (ПорядокСканирования = "СначалаСканированиеЯчейки");

	Если СначалаПоискЯчейки Тогда
		
		ДанныеЯчейки = ДанныеЯчейкиПоШК(ДанныеШтрихкода.Штрихкод); 
		
		Если ЗначениеЗаполнено(ДанныеЯчейки.Ячейка) Тогда
			РезультатСканированияЯчейки(ДанныеЯчейки);
			Возврат;
		КонецЕсли;
				
		Состояние(НСтр("ru = 'Ячейка по штрихкоду не найдена'"));
	Иначе
		
		ДанныеТоваров = ДанныеТоваровПоШК(ДанныеШтрихкода.Штрихкод); 
		
		Если ЗначениеЗаполнено(ДанныеТоваров) Тогда
			РезультатСканированияТовара(ДанныеТоваров);
			Возврат;
		КонецЕсли;
		
		Состояние(НСтр("ru = 'Номенклатура по штрихкоду не найдена'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатСканированияЯчейки(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = Новый ОписаниеОповещения("ЗавершитьОтборИзЯчейки", ЭтотОбъект);
	
	ТоварыВЯчейке = Новый Массив;
	
	Для Каждого Строка Из ТоварыОтобрать Цикл
		
		Если Строка.Ячейка = Результат.Ячейка Тогда
			
			Структура = СтруктураТоваров();
			ЗаполнитьЗначенияСвойств(Структура, Строка);
			
			ТоварыВЯчейке.Добавить(Структура);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ячейка",      Результат.Ячейка);
	ПараметрыФормы.Вставить("Товары",      ТоварыВЯчейке);
	ПараметрыФормы.Вставить("Склад",       Склад);
	ПараметрыФормы.Вставить("Помещение",   Помещение);
	ПараметрыФормы.Вставить("Организация",   Организация);
	ПараметрыФормы.Вставить("ТипОперации", 2);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Ссылка",      Ссылка);
	ПараметрыФормы.Вставить("РаспоряжениеНаОтбор", Распоряжение);
	ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
    ПараметрыФормы.Вставить("ШтрихкодЯчейки", Результат.Штрихкод);
    ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.РазмещениеВЯчейки",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатСканированияТовара(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() > 1 Тогда 
		
		Описание = Новый ОписаниеОповещения("РезультатСканированияТовара", ЭтотОбъект);
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Товары", Результат);
		ЗначенияЗаполнения.Вставить("Режим", "ВыборНоменклатуры");
		ЗначенияЗаполнения.Вставить("Штрихкод", "");
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РезультатСканирования", ЗначенияЗаполнения);
		
		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.ФормаВыбораСканирование", ПараметрыФормы,
			ЭтотОбъект,,,,Описание, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		ДанныеТовара = Результат[0]; 
		
		Описание = Новый ОписаниеОповещения("ДобавитьТовар", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура", ДанныеТовара.Номенклатура);
		ПараметрыФормы.Вставить("Характеристика", ДанныеТовара.Характеристика);
		ПараметрыФормы.Вставить("Серия", ДанныеТовара.Серия);
		ПараметрыФормы.Вставить("Упаковка", ДанныеТовара.Упаковка);
		ПараметрыФормы.Вставить("Количество", ДанныеТовара.Количество);
		ПараметрыФормы.Вставить("Режим", "ОтборИзЯчейкиОтгрузка");
		ПараметрыФормы.Вставить("НомерСтроки", 0);
		ПараметрыФормы.Вставить("Склад", Склад);
		ПараметрыФормы.Вставить("Помещение", Помещение);
		ПараметрыФормы.Вставить("ШтрихкодУпаковки", ДанныеТовара.ШтрихкодУпаковки);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("Источник", Ссылка);
		ПараметрыФормы.Вставить("РаспоряжениеНаОтбор", Распоряжение);
		ПараметрыФормы.Вставить("ШтрихкодДокумента", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
		
		ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОтборИзЯчейки(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьОтборИзЯчейкиНаСервере(Результат);
	Если ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		РезультатСканированияЯчейки(Результат.ДанныеСледующейЯчейки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗавершитьОтборИзЯчейкиНаСервере(Результат)
	
	ТекстОперации = НСтр("ru = 'Не требуется отбор номенклатуры %1 в упаковке %2 из ячейки %3.'");
	
	ТаблицаТовары = ТоварыОтобрать.Выгрузить();
	
	МассивОтбора = Результат.МассивРазмещений;
	Ячейка = Результат.Ячейка;
	
	// Массив структур
	Для Каждого Строка Из МассивОтбора Цикл
		
		Если Строка.КоличествоУпаковок <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Строка.Упаковка, Строка.Номенклатура);
		
		ОтборПоиска = Новый Структура;
		ОтборПоиска.Вставить("Номенклатура",   Строка.Номенклатура);
		ОтборПоиска.Вставить("Характеристика", Строка.Характеристика);
		ОтборПоиска.Вставить("Серия",          Строка.Серия);
		ОтборПоиска.Вставить("Упаковка",       Строка.Упаковка);
		ОтборПоиска.Вставить("Ячейка",         Ячейка);
		
		МассивКОтбору = ТаблицаТовары.НайтиСтроки(ОтборПоиска);
		
		Если Не МассивКОтбору.Количество() Тогда
			ОтборПоиска.Вставить("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка()); 
			МассивКОтбору = ТаблицаТовары.НайтиСтроки(ОтборПоиска);
		КонецЕсли;
		
		Если Не МассивКОтбору.Количество() И ПорядокСканирования = "СначалаСканированиеТовара" Тогда
			ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + СтрШаблон(ТекстОперации, 
				Строка.Номенклатура, Строка.Упаковка, Ячейка);
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТоварыОтобрано.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;

		Если ЗначениеЗаполнено(Строка.ЯчейкаЗамена) Тогда
			НоваяСтрока.Ячейка = Строка.ЯчейкаЗамена;
		КонецЕсли;
		
		Для Каждого СтрокаПоиск Из МассивКОтбору Цикл
			СтрокаПоиск.КоличествоУпаковок = СтрокаПоиск.КоличествоУпаковок - НоваяСтрока.КоличествоУпаковок;
			СтрокаПоиск.Количество = СтрокаПоиск.КоличествоУпаковок;
		КонецЦикла;
		
	КонецЦикла;
	
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого Строка Из ТаблицаТовары Цикл
		Если Строка.КоличествоУпаковок <= 0 Тогда
			МассивУдаляемыхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаУдалить Из МассивУдаляемыхСтрок Цикл
		ТаблицаТовары.Удалить(СтрокаУдалить);
	КонецЦикла;
		
	Для Каждого СтрокаКодМаркировки Из Результат.ШтрихкодыУпаковок Цикл
			
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКодМаркировки);
			
	КонецЦикла;
	
	ТоварыОтобрать.Загрузить(ТаблицаТовары);
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТекстОшибки = "";
	ДобавитьТоварНаСервере(Результат);
	
	Если Результат = Неопределено Тогда		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		Состояние(ТекстОшибки); 
	КонецЕсли;

	Если ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		РезультатСканированияТовара(Результат.ДанныеСледующегоТовара);
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьТоварНаСервере(Знач Результат)
	
	СтруктураПоиска = Новый Структура;
	
	Если Результат = Неопределено Тогда
		
		СтруктураПоиска.Вставить("Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка());		
		РезультатПоиска = ТоварыОтобрано.НайтиСтроки(СтруктураПоиска);
		Для Каждого Строка Из РезультатПоиска Цикл
			ТоварыОтобрано.Удалить(Строка);
		КонецЦикла;
		
		Возврат;
	КонецЕсли; 
		
	Если Не ЗначениеЗаполнено(Результат.Ячейка) И Не ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		НоваяСтрока = ТоварыОтобрано.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
		Возврат;
	КонецЕсли;
	
	МассивОтбора = Новый Массив; 
	
	Если ЗначениеЗаполнено(Результат.Ячейка) Тогда
		Ячейка = Результат.Ячейка;		
	ИначеЕсли ЗначениеЗаполнено(Результат.ДанныеСледующейЯчейки) Тогда
		Ячейка = Результат.ДанныеСледующейЯчейки.Ячейка;
	КонецЕсли; 

	Структура = СтруктураТоваровОтбора();
	ЗаполнитьЗначенияСвойств(Структура, Результат);
	Структура.Ячейка = Ячейка;
	МассивОтбора.Добавить(Структура); 	
	
	Если Не ЗначениеЗаполнено(Результат.ДанныеСледующегоТовара) Тогда
		СтруктураПоиска.Вставить("Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка());
		РезультатПоиска = ТоварыОтобрано.НайтиСтроки(СтруктураПоиска); 
			
		Для Каждого Строка Из РезультатПоиска Цикл
			Структура = СтруктураТоваровОтбора();
			Строка.Ячейка = Ячейка;
			ЗаполнитьЗначенияСвойств(Структура, Строка); 
			МассивОтбора.Добавить(Структура);
		КонецЦикла;
			
		Для Каждого Строка Из РезультатПоиска Цикл
			ТоварыОтобрано.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
		 
	Результат.Вставить("МассивРазмещений", МассивОтбора);
	Результат.Вставить("Ячейка", Ячейка); 
	ЗавершитьОтборИзЯчейкиНаСервере(Результат);
		
КонецПроцедуры

&НаСервере
Функция СтруктураТоваров()
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура","");
	Структура.Вставить("Характеристика","");
	Структура.Вставить("Серия","");
	Структура.Вставить("Упаковка","");
	Структура.Вставить("КоличествоУпаковок","");
	Структура.Вставить("Назначение","");
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ОформитьМеню(ИмяВкладки)
	
	ПоказатьМеню();
	
	Элементы.РамкаОтобрать.Картинка = БиблиотекаКартинок.РамкаМенюБелая;
	Элементы.КомандаОтобрать.ЦветТекста = WebЦвета.ТемноСерый;
	
	Элементы.РамкаОтобрано.Картинка = БиблиотекаКартинок.РамкаМенюБелая;
	Элементы.КомандаОтобрано.ЦветТекста = WebЦвета.ТемноСерый;
	
	Если ИмяВкладки = "Отобрать" Тогда
		Элементы.КомандаОтобрать.ЦветТекста = WebЦвета.Черный;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтобрать;
		Элементы.РамкаОтобрать.Картинка = БиблиотекаКартинок.РамкаМенюЧерная;
	ИначеЕсли ИмяВкладки = "Отобрано" Тогда
		Элементы.КомандаОтобрано.ЦветТекста = WebЦвета.Черный;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтобрано;
		Элементы.РамкаОтобрано.Картинка = БиблиотекаКартинок.РамкаМенюЧерная;
	КонецЕсли;
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиКомандМеню()
	
	Элементы.КомандаОтобрать.Заголовок = СтрШаблон(НСтр("ru = 'Отобрать (%1)'"), ТоварыОтобрать.Количество());
	Элементы.КомандаОтобрано.Заголовок = СтрШаблон(НСтр("ru = 'Отобрано (%1)'"), ТоварыОтобрано.Количество());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
		"ВЫБРАТЬ
		|	ОтборРазмещениеТоваров.Номер КАК Номер,
		|	ОтборРазмещениеТоваров.Дата КАК Дата,
		|	ОтборРазмещениеТоваров.ЗонаОтгрузки КАК ЗонаОтгрузки,
		|	ОтборРазмещениеТоваров.Исполнитель КАК Исполнитель,
		|	ОтборРазмещениеТоваров.Комментарий КАК Комментарий,
		|	ОтборРазмещениеТоваров.Склад КАК Склад,
		|	ОтборРазмещениеТоваров.Помещение КАК Помещение,
		|	ОтборРазмещениеТоваров.Статус КАК Статус,
		|	ОтборРазмещениеТоваров.Распоряжение КАК Распоряжение
		|ИЗ
		|	Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
		|ГДЕ
		|	ОтборРазмещениеТоваров.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОтобрано.Номенклатура КАК Номенклатура,
		|	ТоварыОтобрано.Номенклатура.Артикул КАК Артикул,
		|	ТоварыОтобрано.Характеристика КАК Характеристика,
		|	ТоварыОтобрано.Упаковка КАК Упаковка,
		|	ТоварыОтобрано.Серия КАК Серия,
		|	ТоварыОтобрано.Назначение КАК Назначение,
		|	ТоварыОтобрано.Ячейка КАК Ячейка,
		|	ТоварыОтобрано.КоличествоОтобрано КАК Количество,
		|	ТоварыОтобрано.КоличествоУпаковокОтобрано КАК КоличествоУпаковок
		|ИЗ
		|	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ТоварыОтобрано
		|ГДЕ
		|	ТоварыОтобрано.Ссылка = &Ссылка
		|	И ТоварыОтобрано.КоличествоОтобрано > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОтобрать.Номенклатура КАК Номенклатура,
		|	ТоварыОтобрать.Номенклатура.Артикул КАК Артикул,
		|	ТоварыОтобрать.Характеристика КАК Характеристика,
		|	ТоварыОтобрать.Упаковка КАК Упаковка,
		|	ТоварыОтобрать.Серия КАК Серия,
		|	ТоварыОтобрать.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ТоварыОтобрать.Назначение КАК Назначение,
		|	ТоварыОтобрать.Ячейка КАК Ячейка,
		|	ТоварыОтобрать.КоличествоОтобрано КАК КоличествоОтобрано,
		|	ТоварыОтобрать.Количество КАК Количество,
		|	ТоварыОтобрать.КоличествоУпаковок КАК КоличествоУпаковок
		|ИЗ
		|	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ТоварыОтобрать
		|ГДЕ
		|	ТоварыОтобрать.Ссылка = &Ссылка
		|   И ТоварыОтобрать.КоличествоОтобрано <= 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);

	ТоварыОтобрано.Загрузить(РезультатЗапроса[1].Выгрузить());
	ТоварыОтобрать.Загрузить(РезультатЗапроса[2].Выгрузить());
	
	ИспользоватьСкладскиеПомещения = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Склад, "ИспользоватьСкладскиеПомещения");
	
КонецПроцедуры

&НаСервере
Функция ЗакончитьОтборНаСервере(Результат, ИмяПроцесса)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ИспользоватьСкладскиеПомещения")
		И Помещение.Пустая() Тогда
		
		ТекстОшибки = НСтр("ru = 'Не выбрано помещение'");	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];	
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗонаОтгрузки.Пустая() Тогда
				
		ТекстОшибки = НСтр("ru = 'Не выбрана зона приемки'");	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		
		Возврат Ложь;
		
	КонецЕсли;

	ШаблонОшибкиЗаписать = НСтр("ru = 'Не удалось записать %1. %2'");

	НачатьТранзакцию();
	Попытка

		ДокументОбъект = Ссылка.ПолучитьОбъект();
		ДокументОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;

		ДокументОбъект.Помещение   = Помещение;
		ДокументОбъект.Комментарий = Комментарий;
		ДокументОбъект.ЗонаОтгрузки = ЗонаОтгрузки;
		ДокументОбъект.Исполнитель = Исполнитель;
		
		ДокументОбъект.ТоварыОтбор.Очистить();
			
		Для Каждого Строка Из ТоварыОтобрано Цикл
			
			НоваяСтрока = ДокументОбъект.ТоварыОтбор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
			
			КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Строка.Упаковка, Строка.Номенклатура);
			
			НоваяСтрока.КоличествоОтобрано = Строка.КоличествоУпаковок * КоэффициентУпаковки;
			НоваяСтрока.КоличествоУпаковокОтобрано = Строка.КоличествоУпаковок;
			
			НоваяСтрока.Количество = НоваяСтрока.КоличествоОтобрано;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковокОтобрано;
			
		КонецЦикла;
		
		ПараметрыУказанияСерий = Документы.ОтборРазмещениеТоваров.ПараметрыУказанияСерий(ДокументОбъект);
		МобильноеРабочееМестоКладовщика.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий.Отбор);

#Если МобильныйАвтономныйСервер Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
#Иначе
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
#КонецЕсли

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(ШаблонОшибкиЗаписать, Ссылка,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

		Возврат Ложь;
	КонецПопытки;

	Если ИмяПроцесса = "НеОтгружать" Тогда
		
		// Захват объекта для редактирования
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Распоряжение);
		Исключение
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось заблокировать %1. %2'"), Распоряжение,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));  
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			Возврат Ложь;
		КонецПопытки;
		
		НачатьТранзакцию();
		Попытка
				
			ОрдерОбъект = Распоряжение.ПолучитьОбъект();

			Если Результат = "Завершить" Тогда
				ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.КПроверке;
			Иначе
				ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки;
				ОрдерОбъект.Контролер = МобильноеРабочееМестоКладовщика.ТекущийПользователь();
			КонецЕсли;
			
			СтруктураПоиска = СтруктураТоваров();
			СтруктураПоиска.Удалить("КоличествоУпаковок");
			СтруктураПоиска.Удалить("Упаковка");
			СтруктураПоиска.Вставить("Действие", Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать);
			
			Для Каждого Строка Из ТоварыОтобрать Цикл
				
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
				
				Если Строка.СтатусУказанияСерий = 13 Или Строка.СтатусУказанияСерий = 14 
					Или Строка.СтатусУказанияСерий = 9 Или Строка.СтатусУказанияСерий = 10 Тогда
					СтруктураПоиска.Вставить("Серия", Строка.Серия);
				Иначе
					СтруктураПоиска.Удалить("Серия");
				КонецЕсли;
				
				РезультатПоиска = ОрдерОбъект.ОтгружаемыеТовары.НайтиСтроки(СтруктураПоиска);
				
				Если РезультатПоиска.Количество() > 0 Тогда
					КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(
					РезультатПоиска[0].Упаковка, РезультатПоиска[0].Номенклатура);
					
					РезультатПоиска[0].Количество         = РезультатПоиска[0].Количество - Строка.Количество;
					РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].Количество / КоэффициентУпаковки;
				КонецЕсли; 
				
				КоличествоКРаспределению = Строка.Количество; 
				
				СтруктураПоиска.Удалить("Действие");
					
				НайденныеРаспоряжения = ОрдерОбъект.ТоварыПоРаспоряжениям.НайтиСтроки(СтруктураПоиска);
				Для Каждого СтрокаРаспоряжения Из НайденныеРаспоряжения Цикл
					Если КоличествоКРаспределению >= СтрокаРаспоряжения.Количество Тогда
						КоличествоКРаспределению = КоличествоКРаспределению - СтрокаРаспоряжения.Количество;
						ОрдерОбъект.ТоварыПоРаспоряжениям.Удалить(СтрокаРаспоряжения);
					Иначе
						СтрокаРаспоряжения.Количество = СтрокаРаспоряжения.Количество - КоличествоКРаспределению;
						КоличествоКРаспределению = 0;
					КонецЕсли;
						
					Если КоличествоКРаспределению = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			МассивУдаляемыхСтрок = Новый Массив;
			Для Каждого Строка Из ОрдерОбъект.ОтгружаемыеТовары Цикл	
				Если Строка.Количество <= 0 Тогда
					МассивУдаляемыхСтрок.Добавить(Строка);
				КонецЕсли;
			КонецЦикла;	
			
			Для Каждого СтрокаУдалить Из МассивУдаляемыхСтрок Цикл	
				ОрдерОбъект.ОтгружаемыеТовары.Удалить(СтрокаУдалить);	
			КонецЦикла;

#Если МобильныйАвтономныйСервер Тогда
			ОрдерОбъект.Записать(РежимЗаписиДокумента.Запись);
#Иначе
			ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
#КонецЕсли

			ЗафиксироватьТранзакцию();
		Исключение 
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтрШаблон(ШаблонОшибкиЗаписать, Распоряжение,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
						
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			Возврат Ложь;
		КонецПопытки;
		
	ИначеЕсли Не ИмяПроцесса = "КОтбору" Тогда
		Если Результат = "Завершить" Тогда
			Возврат Обработки.МобильноеРабочееМестоКладовщика.УстановитьСтатусОрдера(Распоряжение,
				Перечисления.СтатусыРасходныхОрдеров.КПроверке); 
		ИначеЕсли Результат = "Проверить" Тогда
			Возврат Обработки.МобильноеРабочееМестоКладовщика.УстановитьСтатусОрдера(Распоряжение,
				Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗонуПриемки()
	
	ЗонаОтгрузки = МобильноеРабочееМестоКладовщика.ЗонаПриемкиПоУмолчанию(Склад, Помещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМеню()

	Элементы.ГруппаМеню.Видимость = Истина;
	Элементы.ГруппаКоманды.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьМеню()

	Элементы.ГруппаМеню.Видимость = Ложь;
	Элементы.ГруппаКоманды.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СобратьВсеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
		|	ТоварыКПоступлениюОстатки.Отправитель КАК Отправитель,
		|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК КоличествоУпаковок,
		|	ТоварыКПоступлениюОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(, ДокументПоступления = &ДокументПоступления) КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0";
	
	Запрос.УстановитьПараметр("ДокументПоступления", РаспоряжениеНаОтгрузку);
	
	Остатки = Запрос.Выполнить().Выгрузить();
	ТоварыОтобрано.Загрузить(Остатки);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьОтборСервер(ИндексСтроки)
	
	ТекущаяСтрока = ТоварыОтобрано[ИндексСтроки];
	
	КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(ТекущаяСтрока.Упаковка, ТекущаяСтрока.Номенклатура);
	
	СтруктураПоиска = СтруктураТоваров(); 
	СтруктураПоиска.Удалить("КоличествоУпаковок");
	СтруктураПоиска.Вставить("Ячейка");
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
	
	РезультатПоиска = ТоварыОтобрать.НайтиСтроки(СтруктураПоиска);
	Если РезультатПоиска.Количество() > 0 Тогда
		РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + ТекущаяСтрока.КоличествоУпаковок;
		РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
	Иначе
		НоваяСтрока = ТоварыОтобрать.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
	КонецЕсли;
	
	ТоварыОтобрано.Удалить(ИндексСтроки);
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьФормуНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуНаСервере(Результат)
	
	Литерал = "НомерСтроки";
	НомерСтроки = Результат[Литерал];
	
	КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Результат.Упаковка, Результат.Номенклатура);
	
	СтруктураПоиска = СтруктураТоваров(); 
	СтруктураПоиска.Удалить("КоличествоУпаковок");
	СтруктураПоиска.Вставить("Ячейка");
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, Результат);
	
	Если Результат.Режим = "РедактированиеОтборИзЯчейкиОтгрузка" Тогда
		
		ИсходноеКоличество = ТоварыОтобрано[Результат.НомерСтроки].КоличествоУпаковок;
		
		ТоварыОтобрано[Результат.НомерСтроки].Упаковка           = Результат.Упаковка;
		ТоварыОтобрано[Результат.НомерСтроки].КоличествоУпаковок = Результат.КоличествоУпаковок;
		ТоварыОтобрано[Результат.НомерСтроки].Количество         = ТоварыОтобрано[Результат.НомерСтроки].КоличествоУпаковок * КоэффициентУпаковки;
		ТоварыОтобрано[Результат.НомерСтроки].Серия              = Результат.Серия;
		ТоварыОтобрано[Результат.НомерСтроки].Назначение         = Результат.Назначение;
		
		РезультатПоиска = ТоварыОтобрать.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + ИсходноеКоличество - Результат.КоличествоУпаковок;
			РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
		ИначеЕсли ИсходноеКоличество - Результат.КоличествоУпаковок > 0 Тогда
			НоваяСтрока = ТоварыОтобрать.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			НоваяСтрока.КоличествоУпаковок = ИсходноеКоличество - Результат.КоличествоУпаковок;
			НоваяСтрока.Количество         = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
		КонецЕсли;
		
	Иначе
		
		ТоварыОтобрать[НомерСтроки].Упаковка = Результат.Упаковка;
		ТоварыОтобрать[НомерСтроки].КоличествоУпаковок = ТоварыОтобрать[НомерСтроки].КоличествоУпаковок - Результат.КоличествоУпаковок;
		ТоварыОтобрать[НомерСтроки].Количество = ТоварыОтобрать[НомерСтроки].КоличествоУпаковок * КоэффициентУпаковки;
		
		РезультатПоиска = ТоварыОтобрано.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + Результат.КоличествоУпаковок;
			РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
		ИначеЕсли Результат.КоличествоУпаковок > 0 Тогда
			НоваяСтрока = ТоварыОтобрано.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
		КонецЕсли;
		
	КонецЕсли;
	
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого Строка Из ТоварыОтобрать Цикл
		Если Строка.Количество <= 0 Тогда
			МассивУдаляемыхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
			
	Для Каждого СтрокаУдалить Из МассивУдаляемыхСтрок Цикл
		ТоварыОтобрать.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого Строка Из ТоварыОтобрано Цикл	
		Если Строка.Количество <= 0 Тогда
			МассивУдаляемыхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
			
	Для Каждого СтрокаУдалить Из МассивУдаляемыхСтрок Цикл
		ТоварыОтобрано.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	СформироватьЗаголовкиКомандМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПродолжение(Результат, Параметры = Неопределено) Экспорт
	
	Если Результат = "Продолжить" Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗначений = Новый СписокЗначений();
	
	Если Результат = "НеОтгружать" Или Результат = "Завершить" Тогда	
		
		Если ЕстьПравоНаПроверкуОрдера И Бесшовный Тогда
			СписокЗначений.Добавить("Проверить", НСтр("ru = 'Перейти к проверке ордера'"));
			СписокЗначений.Добавить("Завершить", НСтр("ru = 'Завершить работу с ордером'"));
			СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить отбор'"));
			ТекстСообщения = НСтр("ru = 'После завершения отбора перейти к проверке ордера или завершить работу с текущим ордером?'");
		Иначе
			СписокЗначений.Добавить("Завершить", НСтр("ru = 'Завершить'"));
			СписокЗначений.Добавить("Продолжить", НСтр("ru = 'Продолжить'"));
			ТекстСообщения = НСтр("ru = 'Завершить отбор?'");
		КонецЕсли; 
		
		ДопПараметры = Новый Структура("ИмяПроцесса", Результат);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстСообщения, СписокЗначений, 0);
		
	Иначе 
		ДопПараметры = Новый Структура("ИмяПроцесса", Результат);
		ПослеЗакрытияВопроса("Завершить", ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = "Продолжить" Тогда
		Возврат;
	КонецЕсли;
			
	ОтборЗавершен = ЗакончитьОтборНаСервере(Результат, ДополнительныеПараметры.ИмяПроцесса);

	Если Результат = "Завершить" И ОтборЗавершен Тогда
		Закрыть();
	ИначеЕсли Результат = "Проверить" И ОтборЗавершен Тогда  
		ОткрытьФормуРасходногоОрдера(); 
	Иначе
		Состояние(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияФормыВопроса(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат = "Продолжить" Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = "КОтбору" Тогда
		ОтборЗавершен = ЗакончитьОтборНаСервере("Завершить", "КОтбору");
	Иначе
		ОтборЗавершен = ЗакончитьОтборНаСервере("Завершить", "НеОтгружать");
	КонецЕсли;
	
	Если ОтборЗавершен Тогда
		ОткрытьФормуРасходногоОрдера();
	Иначе
		Состояние(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРасходногоОрдера()
	
	Закрыть(); 
				
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", Распоряжение);
	ПараметрыФормы.Вставить("Исполнитель", Исполнитель);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);
			
	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.РасходныйОрдер", ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.Независимый);
		
КонецПроцедуры 

&НаСервере
Функция ДанныеЯчейкиПоШК(Знач Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеЯчейкиПоШК(Склад, Помещение, Штрихкод);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеТоваровПоШК(Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеТоваровПоШК(Штрихкод); 
	
КонецФункции

&НаКлиенте
Процедура ИзменитьШтрихкодыУпаковок(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьШтрихкодыУпаковокНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьШтрихкодыУпаковокНаСервере(Результат)
	
	ШтрихкодыУпаковок.Очистить();
	ШтрихкодыУпаковок.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОтменитьЗаданиеНаОтбор(Результат, Параметры) Экспорт
	
	Если Результат = "Завершить" Тогда
		
		ОтборОтменен = ОтменитьЗаданиеНаОтборНаСервере();
		
		Если ОтборОтменен Тогда
			Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"] Тогда
				Закрыть();
			КонецЕсли;
			Закрыть();
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьЗаданиеНаОтборНаСервере()
	
#Если МобильныйАвтономныйСервер Тогда
	Возврат Ложь;
#Иначе
	Попытка
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		
		ОбеспечениеВДокументахСервер.ПроверитьЗапуститьФоновоеЗаданиеРаспределенияЗапасов();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось отменить задание на отбор.'"));
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
#КонецЕсли

КонецФункции

&НаСервере
Функция СтруктураТоваровОтбора()
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура","");
	Структура.Вставить("Характеристика","");
	Структура.Вставить("Серия","");
	Структура.Вставить("Назначение","");
	Структура.Вставить("Упаковка","");
	Структура.Вставить("УпаковкаРазмещено","");
	Структура.Вставить("КоличествоУпаковок","");
	Структура.Вставить("КоличествоУпаковокРазмещено","");
	Структура.Вставить("Ячейка","");
	Структура.Вставить("ЯчейкаЗамена","");
	Структура.Вставить("НомерСтроки","");
	
	Возврат Структура;
	
КонецФункции 

#КонецОбласти
